In [4]:
import pandas as pd

In [8]:
items = {'ebi': pd.Series([245, 25, 55], index = ['bike', 'pants', 'watch']), 
         'sara': pd.Series([40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants']),
          'nima': pd.Series([60, 120, 503], index = ['book', 'glasses', 'bike']) }

In [9]:
shopping_bills = pd.DataFrame(items)
shopping_bills

           ebi   sara   nima
bike     245.0  500.0  503.0
book       NaN   40.0   60.0
glasses    NaN  110.0  120.0
pants     25.0   45.0    NaN
watch     55.0    NaN    NaN

# There are several things to notice here, as explained below:

1. We see that DataFrames are displayed in tabular form, much like an Excel spreadsheet, with the labels of rows and columns in bold.
2. Also, notice that the row labels of the DataFrame are built from the union of the index labels of the two Pandas Series we used to construct the dictionary. And the column labels of the DataFrame are taken from the keys of the dictionary.
3. Another thing to notice is that the columns are arranged alphabetically and not in the order given in the dictionary. We will see later that this won't happen when we load data into a DataFrame from a data file.
4. The last thing we want to point out is that we see some NaN values appear in the DataFrame. NaN stands for Not a Number, and is Pandas way of indicating that it doesn't have a value for that particular row and column index.

In [11]:
list(shopping_bills.index)

['bike', 'book', 'glasses', 'pants', 'watch']

In [13]:
list(shopping_bills.columns)

['ebi', 'sara', 'nima']

In [14]:
shopping_bills.values

array([[245., 500., 503.],
       [ nan,  40.,  60.],
       [ nan, 110., 120.],
       [ 25.,  45.,  nan],
       [ 55.,  nan,  nan]])

In [15]:
shopping_bills.shape

(5, 3)

# Select items for creating the data frames

In [16]:
ebi_shopping_bills = pd.DataFrame(items, columns=['ebi'])
ebi_shopping_bills

       ebi
bike   245
pants   25
watch   55

In [17]:
ebi_shopping_bills = pd.DataFrame(items, index=['bike', 'watch'])
ebi_shopping_bills

       ebi   sara   nima
bike   245  500.0  503.0
watch   55    NaN    NaN

In [22]:
# Create data frame using an array of maps

data = [{'a': i, 'b': i*2} for i in range(10)]
df = pd.DataFrame(data)
df

   a   b
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10
6  6  12
7  7  14
8  8  16
9  9  18